12/data/attachments/342f14107504d621.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_76f57f86-887b-4498-a294-700f7abfc864</nif:username>
            <nif:friendToBeAdded>Jeffrey_pay_Actions_38237_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>